openwch/arduino_core_ch32/system/CH32X035/SRC/Peripheral/src/ch32x035_adc.c
    itmask = ADC_IT >> 8;
    enablestatus = (ADCx->CTLR1 & (uint8_t)ADC_IT);

    if(((ADCx->STATR & itmask) != (uint32_t)RESET) && enablestatus)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      ADC_ClearITPendingBit
 *
 * @brief   Clears the ADCx's interrupt pending bits.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          ADC_IT - specifies the ADC interrupt pending bit to clear.
 *            ADC_IT_EOC - End of conversion interrupt mask.
 *            ADC_IT_AWD - Analog watchdog interrupt mask.
 *            ADC_IT_JEOC - End of injected conversion interrupt mask.
 *
 * @return  none
 */
void ADC_ClearITPendingBit(ADC_TypeDef *ADCx, uint16_t ADC_IT)
{
    uint8_t itmask = 0;

    itmask = (uint8_t)(ADC_IT >> 8);
    ADCx->STATR = ~(uint32_t)itmask;
}

/*********************************************************************
 * @fn      ADC_AnalogWatchdogResetCmd
 *
 * @brief   Enables or disables the analog watchdog reset
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          ADC_AnalogWatchdog_x -  Analog watchdog X.
 *            ADC_AnalogWatchdog_0_RST_EN.
 *            ADC_AnalogWatchdog_1_RST_EN.
 *            ADC_AnalogWatchdog_2_RST_EN.
 *            ADC_AnalogWatchdog_3_RST_EN.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_AnalogWatchdogResetCmd(ADC_TypeDef *ADCx, uint32_t ADC_AnalogWatchdog_x, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
      ADCx->CTLR3 |= ADC_AnalogWatchdog_x;
  }
  else
  {
      ADCx->CTLR3 &= ~ADC_AnalogWatchdog_x;
  }
}

/*********************************************************************
 * @fn      ADC_AnalogWatchdogScanCmd
 *
 * @brief   Enable ADC clock duty cycle adjustment.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_AnalogWatchdogScanCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
      ADCx->CTLR3 |= (1<<9);
    }
    else
    {
      ADCx->CTLR3 &= ~(1<<9);
    }
}

/*********************************************************************
 * @fn      ADC_CLKConfig
 *
 * @brief   Configures the PADC clock.
 *          Note - ADC_CLK_Div_x > H_Level_Cycles_x
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          ADC_CLK_Div_x - defines the ADC clock divider.
 *            ADC_CLK_Div4 - ADC clock = SYSCLK/4
 *            ADC_CLK_Div5 - ADC clock = SYSCLK/5
 *            ADC_CLK_Div6 - ADC clock = SYSCLK/6
 *            ADC_CLK_Div7 - ADC clock = SYSCLK/7
 *            ADC_CLK_Div8 - ADC clock = SYSCLK/8
 *            ADC_CLK_Div9 - ADC clock = SYSCLK/9
 *            ADC_CLK_Div10 - ADC clock = SYSCLK/10
 *            ADC_CLK_Div11 - ADC clock = SYSCLK/11
 *            ADC_CLK_Div12 - ADC clock = SYSCLK/12
 *            ADC_CLK_Div13 - ADC clock = SYSCLK/13
 *            ADC_CLK_Div14 - ADC clock = SYSCLK/14
 *            ADC_CLK_Div15 - ADC clock = SYSCLK/15
 *            ADC_CLK_Div16 - ADC clock = SYSCLK/16
 * @return  none
 */
void ADC_CLKConfig(ADC_TypeDef *ADCx, uint32_t ADC_CLK_Div_x)
{
  uint32_t tmpreg = 0;

  tmpreg = ADCx->CTLR3;

  tmpreg &= CTLR3_CLK_Mask;
  tmpreg |= ADC_CLK_Div_x;
  ADCx->CTLR3 = tmpreg;
}

